/*------------------------------------------------------------------------
【程序设计】
--------------------------------------------------------------------------
程序功能：从键盘输入三个整数，比较三个数并显示相应信息，具体如下：
（1）如果三个数都相等，显示"***"；
（2）如果三个数中只有某两个数相等，显示"$$"；
（3）如果三个数互不相等，则显示"#"。
（输出要换行）
------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
//#include<stdio.h>
//int main()
//{
//    int a,b,c;
//    scanf("%d%d%d",&a,&b,&c);
//    /**********Program**********/
//    if(a==b&&b==c&&a==c)  printf("***");
//    else if(a==b||b==c||a==c)  printf("$$");
//	else  printf("#");
//    /**********  End  **********/
//    return 0;
//} 