/*------------------------------------------------------------------------
【程序设计】
--------------------------------------------------------------------------
程序功能：输入任一字符，若是大写字母将其改为小写字母；若是小写字母，将其改
为大写字母；若是其它字符则不变。
------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
#include<stdio.h>
int main()
{
    char c;
    c=getchar();
    /**********Program**********/
if (c >= 'a' && c <= 'z')
    c=c-32;
 else if (c >= 'A' && c <= 'Z')
    c=c+32;
    /**********  End  **********/
    printf("%c\n",c);
} 
