/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：求摄氏温度26°C对应的华氏温度。计算公式：f = 9*c/5 + 32，
      式中：c表示摄氏温度，f表示华氏温度。
输入输出示例：
celsius = 26, fahr = 78 如样张所示
------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
//#include <stdio.h>
//void main()
//{
//    int celsius, fahr;  
//    /**********Program**********/
//    scanf("%d%d", &celsius, &fahr);
//    fahr = 9 * celsius / 5 + 32;
//    /**********  End  **********/
//    printf("celsius = %d, fahr = %d\n", celsius, fahr); 
//} 